In [1]:
import pandas as pd
import numpy as np

In [24]:
data =  {'eng':[10,30,50,70],
         'kor':[20,40,60,80],
         'math':[90,50,20,70]}
df = pd.DataFrame(data,index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

### 산술연산

In [3]:
df + 1

   eng  kor  math
a   11   21    91
b   31   41    51
c   51   61    21
d   71   81    71

In [4]:
df*2

   eng  kor  math
a   20   40   180
b   60   80   100
c  100  120    40
d  140  160   140

In [9]:
df['eng'] = [1, 2, 3, 4]
df

   eng  kor  math
a    1   20    90
b    2   40    50
c    3   60    20
d    4   80    70

In [12]:
# 특정 칼럼만 연산하고 싶을 때

df['eng'] = df['eng'] + 2
df

   eng  kor  math
a    5   20    90
b    6   40    50
c    7   60    20
d    8   80    70

In [15]:
# 특정 행에 대한 연산

df.loc['a'] = df.loc['a'] + 2
df

   eng  kor  math
a    7   22    92
b    6   40    50
c    7   60    20
d    8   80    70

In [18]:
# 특정 영역 수정

df.loc['b':'c', 'kor':] = [[1, 2], [3, 4]]
df

   eng  kor  math
a    7   22    92
b    6    1     2
c    7    3     4
d    8   80    70

In [19]:
# 특정 영역 수정

df.loc['b':'c', 'kor':] = df.loc['b':'c', 'kor':] + 2
df

   eng  kor  math
a    7   22    92
b    6    3     4
c    7    5     6
d    8   80    70

# 불리안 인덱싱 - 행 단위

In [20]:
df[[True, False, False, True]]

   eng  kor  math
a    7   22    92
d    8   80    70

### 관계 논리 연산자

In [26]:
df[df['eng'] > 30]
# 불리안 인덱싱 - True에 해당하는 행만 선택

   eng  kor  math
c   50   60    20
d   70   80    70

In [28]:
df[df['eng'] > 30][['eng', 'kor']]

   eng  kor
c   50   60
d   70   80

In [29]:
df[(df['kor'] == 20) | (df['kor'] == 60)]

   eng  kor  math
a   10   20    90
c   50   60    20

In [31]:
df[(df['kor'] >= 20) & (df['kor'] <= 60)]

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [33]:
df[df.isin({'kor':[20, 60]})]

   eng   kor  math
a  NaN  20.0   NaN
b  NaN   NaN   NaN
c  NaN  60.0   NaN
d  NaN   NaN   NaN

In [34]:
df[df['kor'].isin([20, 40])]

# df[(df['kor'] == 20) | (df['kor'] == 60)]

   eng  kor  math
a   10   20    90
b   30   40    50

# query문을 이용

In [36]:
df.query('eng>30')
# df[df['eng'] > 30]

   eng  kor  math
c   50   60    20
d   70   80    70

In [37]:
df.query('kor==20 or kor==60')
# 쿼리문 안을 문자열로 줘야 함
# df[(df['kor'] == 20) | (df['kor'] == 60)]

   eng  kor  math
a   10   20    90
c   50   60    20

In [38]:
# df[(df['kor'] >= 20) & (df['kor'] <= 60)]
df.query('20<=kor<=60')

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [39]:
# 방법 1

num = 30
df[df['eng'] > num]

   eng  kor  math
c   50   60    20
d   70   80    70

In [40]:
# # 방법 2 - 쿼리문 안에는 문자열로 오기 때문에 포매팅을 이용

num = 30
df.query(f'eng>{num}')

   eng  kor  math
c   50   60    20
d   70   80    70